Revit 2027 API
View3D.ShowGridsOnLevels Method
 This method displays the grid lines in this 3D view on the given Levels.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ShowGridsOnLevels(
	ISet<ElementId> levelsIds
)
Public Sub ShowGridsOnLevels (
	levelsIds As ISet(Of ElementId)
)
public:
void ShowGridsOnLevels(
	ISet<ElementId^>^ levelsIds
)
member ShowGridsOnLevels :
        levelsIds : ISet<ElementId> -> unit
Parameters
levelsIds ISet<ElementId>
 Levels ids where grids lines will be displayed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Previously selected Levels for showing grids will be replaced with the new ids.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace